app/Controllers/Owner/Expenditures.php

SELECT *
FROM `expenditures`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `expenditures`
---
        $perPage = 10;
        $page = (int) ($this->request->getVar('page') ?? 1);

        $expenditures = $this->expendituresModel->orderBy('id', 'DESC')->paginate($perPage);