app/Models/EmployesModel.php

SELECT *
FROM `employes`
---
    public function getAllData(){
        return $this->findAll();