app/Models/ProductModel.php

SELECT *
FROM `products`
---
    public function getAllData(){
        return $this->findAll();