app/Models/SupplierModel.php

    public function getAllData(){
        return $this->findAll();
---
SELECT *
FROM `suppliers`